/* This computer's Internet connection appears to be offline. */
"CONNECTION_DOWN" = "يبدو أن اتصال الكمبيوتر بالإنترنت في وضع عدم الاتصال.";

/* This computer's Internet connection may be offline. */
"CONNECTION_INDETERMINATE" = "قد يكون اتصال الكمبيوتر بالإنترنت في وضع عدم الاتصال.";

/* This computer's Internet connection appears to be online. */
"CONNECTION_UP" = "يبدو أن اتصال الكمبيوتر بالإنترنت في وضع الاتصال.";

/* This computer's DNS server is not responding. */
"NAMESERVER_DOWN" = "خادم DNS الخاص بهذا الكمبيوتر لا يستجيب.";

/* The DNS server could not find the server name. */
"NAMELOOKUP_FAILED" = "تعذر على خادم DNS العثور على اسم الخادم.";

/* This computer's router is not responding. */
"ROUTER_DOWN" = "جهاز التوجيه الخاص بالكمبيوتر لا يستجيب.";

/* The server this computer is attempting to connect to is not responding. */
"SERVER_DOWN" = "الخادم الذي يحاول جهاز الكمبيوتر هذا الاتصال به لا يستجيب.";

/* This computer's Internet connection appears to be online. */
"SERVER_UP" = "يبدو أن اتصال الكمبيوتر بالإنترنت في وضع الاتصال.";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"KEYCHAIN_LABEL_FORMAT" = "%@ (%@)";

/* Kind string used for keychain items from forms-based logins */
"KEYCHAIN_WEB_FORM_PASSWORD" = "كلمة سر نموذج الويب";

/* HTTP result code string */
"accepted" = "مقبول";

/* HTTP result code string */
"bad gateway" = "عبّارة غير صالحة";

/* HTTP result code string */
"bad request" = "طلب غير صالح";

/* HTTP result code string */
"client error" = "خطأ في العميل";

/* HTTP result code string */
"conflict" = "تعارض";

/* HTTP result code string */
"continue" = "متابعة";

/* HTTP result code string */
"created" = "تم الإنشاء";

/* HTTP result code string */
"expectation failed" = "فشل التوقع";

/* HTTP result code string */
"forbidden" = "ممنوع";

/* HTTP result code string */
"found" = "تم العثور عليه";

/* HTTP result code string */
"gateway timed out" = "انتهت مهلة العبّارة";

/* HTTP result code string */
"informational" = "معلوماتيّ";

/* HTTP result code string */
"internal server error" = "خطأ خادم داخلي";

/* HTTP result code string */
"length required" = "الطول المطلوب";

/* HTTP result code string */
"method not allowed" = "الطريقة غير مسموح بها";

/* HTTP result code string */
"moved permanently" = "تم النقل نهائيًا";

/* HTTP result code string */
"multiple choices" = "اختيارات متعددة";

/* HTTP result code string */
"needs proxy" = "يحتاج إلى مُلقم";

/* HTTP result code string */
"no content" = "بلا محتوى";

/* HTTP result code string */
"no error" = "لا يوجد خطأ";

/* HTTP result code string */
"non-authoritative information" = "معلومات غير مخوّل بها";

/* HTTP result code string */
"not found" = "لم يتم العثور عليه";

/* HTTP result code string */
"not modified" = "غير معدّلة";

/* HTTP result code string */
"partial content" = "محتوى جزئي";

/* HTTP result code string */
"payment required" = "يلزم الدفع";

/* HTTP result code string */
"precondition failed" = "فشل الشرط المسبق";

/* HTTP result code string */
"proxy authentication required" = "مصادقة المُلقم مطلوبة";

/* HTTP result code string */
"redirected" = "تمت إعادة التوجيه";

/* HTTP result code string */
"no longer exists" = "لم يعد موجودًا";

/* HTTP result code string */
"request timed out" = "انتهت مهلة الطلب";

/* HTTP result code string */
"request too large" = "الطلب كبير جدًا";

/* HTTP result code string */
"requested URL too long" = "عنوان URL المطلوب طويل جدًا";

/* HTTP result code string */
"requested range not satisfiable" = "النطاق المطلوب غير مُرضي";

/* HTTP result code string */
"reset content" = "إعادة تعيين المحتوى";

/* HTTP result code string */
"see other" = "راجع أخرى";

/* HTTP result code string */
"server error" = "خطأ في الخادم";

/* HTTP result code string */
"service unavailable" = "الخدمة غير متوفرة";

/* HTTP result code string */
"success" = "نجاح";

/* HTTP result code string */
"switching protocols" = "تبديل البروتوكولات";

/* HTTP result code string */
"temporarily redirected" = "تمت إعادة التوجيه مؤقتًا";

/* HTTP result code string */
"unacceptable" = "غير مقبول";

/* HTTP result code string */
"unauthorized" = "غير مصرّح به";

/* HTTP result code string */
"unimplemented" = "غير مطبّق";

/* HTTP result code string */
"unsupported media type" = "نوع وسائط غير مدعوم";

/* HTTP result code string */
"unsupported version" = "إصدار غير مدعوم";

/* kCFErrorHTTPProxyConnectionFailure description */
"Err306" = "كان هناك خطأ في الاتصال مع خادم الويب المُلقم (HTTP).";

/* kCFErrorHTTPSProxyConnectionFailure description */
"Err310" = "كان هناك خطأ في الاتصال مع خادم الويب المُلقم الآمن (HTTPS).";

/* WebFoundationErrorUnknown description */
"Err-998" = "خطأ غير معروف";

/* WebFoundationErrorCancelled description */
"Err-999" = "مُلغى";

/* WebFoundationErrorBadURLError description */
"Err-1000" = "‏URL غير صالح";

/* WebFoundationErrorTimedOut description */
"Err-1001" = "انتهت مهلة الطلب.";

/* WebFoundationErrorUnsupportedURL description */
"Err-1002" = "‏URL غير مدعوم";

/* WebFoundationErrorCannotFindHostError description */
"Err-1003" = "لم يتم العثور على خادم باسم المضيف المحدد.";

/* WebFoundationErrorCannotConnectToHostError description */
"Err-1004" = "لا يمكن الاتصال بالخادم.";

/* WebFoundationErrorNetworkConnectionLostError description */
"Err-1005" = "تم فقد اتصال الشبكة.";

/* WebFoundationErrorDNSLookupError description */
"Err-1006" = "خطأ في البحث عن DNS";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"Err-1007" = "يوجد الكثير من عمليات إعادة توجيه HTTP";

/* WebFoundationErrorResourceUnavailableError description */
"Err-1008" = "المورد غير متوفر";

/* WebFoundationErrorNotConnectedToInternetError description */
"Err-1009" = "يبدو أن الاتصال بالإنترنت في وضع عدم الاتصال.";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"Err-1010" = "تمت إعادة التوجيه إلى مكان غير محدد";

/* WebFoundationErrorBadServerResponseError description */
"Err-1011" = "كان هناك استجابة غير صحيحة من الخادم.";

/* WebFoundationErrorZeroByteResourceError description */
"Err-1014" = "مورد بحجم صفر بايت";

/* WebFoundationErrorCannotDecodeRawData description */
"Err-1015" = "لا يمكن فك ترميز البيانات الأولية";

/* WebFoundationErrorCannotDecodeContentData description */
"Err-1016" = "لا يمكن فك ترميز بيانات المحتوى";

/* WebFoundationErrorCannotParseResponse description */
"Err-1017" = "لا يمكن توزيع الاستجابة";

/* kCFURLErrorInternationalRoamingOff description */
"Err-1018" = "التجوال الدولي مغلق حاليًا.";

/* kCFURLErrorCallIsActive description */
"Err-1019" = "لا يمكن إنشاء اتصال بيانات لوجود مكالمة فعّالة حاليًا.";

/* kCFURLErrorDataNotAllowed description */
"Err-1020" = "اتصال البيانات غير مسموح به حاليًا.";

/* kCFURLErrorRequestBodyStreamExhausted description.  Should never be seen by an end user. */
"Err-1021" = "طلب تدفق النص قد استُنفذ";
	
/* WebFoundationErrorFileDoesNotExist description */
"Err-1100" = "‏URL المطلوب غير موجود على هذا الخادم.";

/* WebFoundationErrorFileIsDirectory description */
"Err-1101" = "الملف عبارة عن دليل";

/* WebFoundationErrorNoPermissionsToReadFile description */
"Err-1102" = "لا يتوفر لديك الإذن للوصول إلى المصدر المطلوب.";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"Err-1103" = "تجاوز المورد الحد الأقصى للحجم";

/* WebFoundationErrorSecureConnectionFailed description */
"Err-1200" = "حدث خطأ في SSL ولا يمكن عمل اتصال آمن للخادم.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201" = "انتهت مدة صلاحية شهادة الخادم.";

/* WebFoundationErrorServerCertificateHasBadDate description */
"Err-1201.w" = "انتهت مدة صلاحية شهادة الخادم. يمكن أن تكون على اتصال بخادم مدّعى أنه “%@” الذي يمكن أن يعرّض معلوماتك السرية للخطر.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202" = "شهادة هذا الخادم غير صالحة.";

/* WebFoundationErrorServerCertificateUntrusted description */
"Err-1202.w" = "شهادة هذا الخادم غير صالحة. يمكن أن تكون على اتصال بخادم مدّعى أنه “%@” الذي يمكن أن يعرّض معلوماتك السرية للخطر.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203" = "الشهادة لهذا الخادم موقعة من قِبل جهة موثقة غير معروفة.";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"Err-1203.w" = "الشهادة لهذا الخادم موقعة من قِبل جهة موثقة غير معروفة. يمكن أن تكون على اتصال بخادم مدّعى أنه “%@” الذي يمكن أن يعرّض معلوماتك السرية للخطر.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204" = "الشهادة لهذا الخادم غير صالحة بعد.";

/* WebFoundationErrorServerCertificateNotYetValid description */
"Err-1204.w" = "الشهادة لهذا الخادم غير صالحة بعد. يمكن أن تكون على اتصال بخادم مدّعى أنه “%@” الذي يمكن أن يعرّض معلوماتك السرية للخطر.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205" = "لم يقبل الخادم الشهادة.";

/* WebFoundationErrorClientCertificateRejected description */
"Err-1205.w" = "لم يقبل الخادم “%@” الشهادة.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206" = "الخادم يتطلب شهادة عميل.";

/* WebFoundationErrorClientCertificateRequired description */
"Err-1206.w" = "الخادم “%@” يتطلب شهادة عميل.";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"Err-2000" = "لا يمكن التحميل من الشبكة";

/* WebFoundationErrorCannotCreateFile description */
"Err-3000" = "لا يمكن إنشاء الملف";

/* WebFoundationErrorCannotOpenFile description */
"Err-3001" = "لا يمكن فتح الملف";

/* WebFoundationErrorCannotCloseFile description */
"Err-3002" = "حدث فشل أثناء إغلاق الملف";

/* WebFoundationErrorCannotWriteToFile description */
"Err-3003" = "لا يمكن كتابة الملف";

/* WebFoundationErrorCannotRemoveFile description */
"Err-3004" = "لا يمكن إزالة الملف";

/* WebFoundationErrorCannotMoveFile description */
"Err-3005" = "لا يمكن نقل الملف";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Err-3006" = "فشل فك ترميز التنزيل";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Err-3007" = "فشل فك ترميز التنزيل";

/* Recovery suggestion */
"Would you like to connect to the server anyway?" = "هل تود الاتصال بالخادم على أي حال؟";

/* Recovery suggestion */
"To change your proxy settings, open Network preferences, click Advanced, and then click Proxies. For help with this problem, contact your system administrator." = "لتغيير إعدادات المُلقم الخاص بك، قم بفتح تفضيلات الشبكة، انقر على متقدم، ثم انقر على مُلقمات. للحصول على مساعدة حول هذه المشكلة، قم بالاتصال بمسؤول النظام.";

/* AuthBrokerAgent proxy credential user notification - alert header */
"Proxy Authentication Required" = "مصادقة المُلقم مطلوبة";

/* AuthBrokerAgent proxy credential user notification - alert message, args are 1) proxy type, 2) host name, 3) port number, e.g.:  Authentication for HTTP proxy csd3.apple.com:8080 */
"Authentication for %@ proxy\n%@:%d" = "مصادقة على مُلقم %@ \n%@:%d";

/* AuthBrokerAgent proxy credential user notification - Cancel button title */
"Cancel" = "إلغاء";

/* AuthBrokerAgent proxy credential user notification - Username title */
"Username" = "اسم المستخدم";

/* AuthBrokerAgent proxy credential user notification - Password title */
"Password" = "كلمة السر";
